module Task4_2 where

{-
  Задание 4.1
  Реализация монады над множеством из четырёх элементов.
  Реализуйте все требуемые классы типов и объясните, почему они реализованы именно так.
-}

data FourOf a = FourOf a a a a deriving(Show,Eq)

-- реализуйте классы `Functor`, `Applicative` и `Monad` для типа `FourOf`
-- таким образом, что
-- do { x <- FourOf 1 2 3 4; y <- FourOf 4 6 7 8; return $ x + y } === FourOf 5 8 10 12

-- Functor нужен для того, чтобы применять функцию к упакованному значению,
-- используя fmap. В данной реализации для каждого из четырех аргументов мы просто будем 
-- выполнять функцию на этом аргументе.
-- Тип fmap: (a -> b) -> f a -> f b.
instance Functor FourOf where
  fmap f (FourOf x1 x2 x3 x4) = FourOf (f x1) (f x2) (f x3) (f x4)

-- Аппликативный функтор нужен для применения упакованной функции
-- к упакованному значению, используя <*>.
-- Тип последовательного применения <*>: f (a -> b) -> f a -> f b. 
-- Здесь нам нужно вынуть из первого контейнера (контекста) четыре 
-- функции и применить их на четырех аргументов второго контекста.
instance Applicative FourOf where
  pure x = FourOf x x x x
  (FourOf f1 f2 f3 f4) <*> (FourOf x1 x2 x3 x4) = FourOf (f1 x1) (f2 x2) (f3 x3) (f4 x4)

-- Монада нужна для того, чтобы применять функцию, возвращающую  упакованное значение,
-- к упакованному значению, используя >>=. Тип (>>=): m a -> (a -> m b) -> m b. 
-- return == pure, поэтому явно не пишу.
-- Здесь мы "распаковываем" контекст, берем все четыре аргумента, для каждого выполняем 
-- функцию f, которая возвращает тип FourOf. Из полученного нового контекста берем нужные аргументы,
-- упаковываем и возвращаем один новый сформированный контекст.
instance Monad FourOf where
  (FourOf x1 x2 x3 x4) >>= f = FourOf (f1 $ f x1) (f2 $ f x2) (f3 $ f x3) (f4 $ f x4) where
    f1 (FourOf y1 _ _ _) = y1
    f2 (FourOf _ y2 _ _) = y2
    f3 (FourOf _ _ y3 _) = y3
    f4 (FourOf _ _ _ y4) = y4
    